src/cf/AccumulationRegisters/bon_ПартииБонусовНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>bon_ПартииБонусовНаСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Буфер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПримВыдано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаБонуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_ХарактеристикиБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_ТелефоныНомОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ТелефоныНомОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотовый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/HTTPServices/bonuses/Ext/Module.bsl
Функция ШаблоныAvailable(Запрос)
	СтатусОтвета = 200;
	
	Попытка
		Токен = Запрос.Заголовки.Получить("Authorization");
		Если Токен <> "VSj90ehR2FD08saZye4HVHHeFukYkW" Тогда
			ВызватьИсключение "Не верный токен";
		КонецЕсли;
		
		//Получаем номер телефона
		ОтносительныйURL = нрег(Запрос.ОтносительныйURL);
		НомерКлиента = СтрЗаменить(ОтносительныйURL,"/available/","");
		
		//Запрос данных по номеру телефона
		Бонусы = ПолучитьДанныеПоТелефону(НомерКлиента);
		
		Если Бонусы.Количество() = 0 Тогда
			СтатусОтвета = 404;
			XMLСтрока = "";
		Иначе
			//XML
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			ЗаписьXML.ЗаписатьОбъявлениеXML();
			
			//Запись данных в XML
			ЗаписатьЗначение(Бонусы,ЗаписьXML);
			XMLСтрока = ЗаписьXML.Закрыть();
		КонецЕсли;
		
	Исключение
		
		СтатусОтвета = 500;
		
	КонецПопытки;
	
	
	Ответ = Новый HTTPСервисОтвет(СтатусОтвета);
	Ответ.Заголовки["Content-Type"] = "text/xml; charset=utf-8";
	Ответ.УстановитьТелоИзСтроки(XMLСтрока);	
	Возврат Ответ;
КонецФункции

Функция ПолучитьДанныеПоТелефону(НомерКлиента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	bon_ПартииБонусовНаСчетахОстаткиИОбороты.БуферКонечныйОстаток КАК future,
	               |	bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокКонечныйОстаток КАК available,
	               |	bon_ПартииБонусовНаСчетахОстаткиИОбороты.ОстатокРасход КАК used
	               |ИЗ
	               |	РегистрНакопления.bon_ПартииБонусовНаСчетах.ОстаткиИОбороты(, , , , ) КАК bon_ПартииБонусовНаСчетахОстаткиИОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.bon_ТелефоныНомОбъектов КАК bon_ТелефоныНомОбъектов
	               |		ПО bon_ПартииБонусовНаСчетахОстаткиИОбороты.НоминальныйОбъект.Держатель = bon_ТелефоныНомОбъектов.Контрагенты
	               |ГДЕ
	               |	bon_ТелефоныНомОбъектов.Сотовый = &Сотовый";
	Запрос.УстановитьПараметр("Сотовый",НомерКлиента);
	
	Бонусы = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовЭлемент = Новый Структура("phone, summary");
		НовЭлемент.phone = НомерКлиента;
		
		СуммаБонусов 	= 	Новый Структура("available,future,used");
		СуммаБонусов.available = ФорматироватьЧисло(Выборка.available);
		СуммаБонусов.future = ФорматироватьЧисло(Выборка.future);
		СуммаБонусов.used = ФорматироватьЧисло(Выборка.used);
		НовЭлемент.summary = СуммаБонусов;
		Бонусы.Добавить(НовЭлемент,"bonuses");
	КонецЦикла;
	
	Возврат Бонусы;
КонецФункции

Процедура XMLСтруктура(ТекЭлемент,ЗаписьXML)
	Для Каждого ТекСвойство Из ТекЭлемент Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТекСвойство.Ключ);
		ЗаписатьЗначение(ТекСвойство.Значение,ЗаписьXML);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // КлючДоп
	КонецЦикла;
КонецПроцедуры

Процедура XMLСписокЗначений(СпЗначений,ЗаписьXML)
	Для Каждого ТекЭлемент Из СпЗначений Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТекЭлемент.Представление);
		ЗаписатьЗначение(ТекЭлемент.Значение,ЗаписьXML);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Ключ
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьЗначение(Значение,ЗаписьXML)
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		XMLСписокЗначений(Значение,ЗаписьXML);
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура") Тогда
		XMLСтруктура(Значение,ЗаписьXML);
	Иначе
		ЗаписьXML.ЗаписатьТекст(Строка(Значение));
	КонецЕсли;
КонецПроцедуры

Функция ФорматироватьЧисло(ИсходноеЧисло)
	ФорматированноеЧисло = ИсходноеЧисло;
	ФорматированноеЧисло = СтрЗаменить(ФорматированноеЧисло,Символ(160),"");
	ФорматированноеЧисло = СтрЗаменить(ФорматированноеЧисло,",",".");
	Возврат ФорматированноеЧисло;
КонецФункции
